In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from collections import deque
from surprise import Dataset, NormalPredictor, Reader
from surprise.model_selection import cross_validate
import os
from sklearn.model_selection import train_test_split
import pickle

In [2]:
movie_titles = pd.read_csv('movie_titles.csv', header=None, encoding='ISO-8859-1', 
                          names=['movie_id', 'year', 'title', 'description1', 'description2',
                                'description3'])

In [3]:
movie_titles = movie_titles.drop(columns=['description1', 'description2', 'description3'], axis=1)

In [4]:
df_ratings = pd.read_csv('netflix_sample.csv')
df_ratings.head()

   Unnamed: 0  user_id  rating        date  movie_id
0    36420325   841872     3.0  2003-03-21      6464
1    42791681   689085     2.0  2004-05-19      7590
2    64859971  2529854     4.0  2005-10-22     11837
3    59155484  2597445     4.0  2005-01-25     10886
4    30218564  2336656     3.0  2005-07-01      5522

In [5]:
df_ratings = df_ratings.drop('Unnamed: 0', axis=1)
df_ratings.head()

   user_id  rating        date  movie_id
0   841872     3.0  2003-03-21      6464
1   689085     2.0  2004-05-19      7590
2  2529854     4.0  2005-10-22     11837
3  2597445     4.0  2005-01-25     10886
4  2336656     3.0  2005-07-01      5522

In [6]:
movie_titles.head()

   movie_id    year                         title
0         1  2003.0               Dinosaur Planet
1         2  2004.0    Isle of Man TT 2004 Review
2         3  1997.0                     Character
3         4  1994.0  Paula Abdul's Get Up & Dance
4         5  2004.0      The Rise and Fall of ECW

In [7]:
#!pwd

/Users/alecclarkfeather/capstone_project

In [9]:
PATH = '/Users/alecclarkfeather/capstone_project'

os.mkdir(PATH + '/rmse_train_test_folds')

In [12]:
RMSE_PATH = PATH + '/rmse_train_test_folds'
states = [10, 20, 30, 40, 50]

for i, state in enumerate(states):
    train_df, test_df = train_test_split(df_ratings, test_size=0.5, random_state=state)
    train_df.to_csv(RMSE_PATH + f'/train_df{i}.csv')
    test_df.to_csv(RMSE_PATH + f'/test_df{i}.csv')

In [13]:
#df_ratings['user_id'].nunique()

264059

In [14]:
df_ratings.duplicated().sum()

0

In [17]:
#top_rated_per_user = df_ratings.groupby(['user_id', 'movie_id'])['rating'].max()
#top_rated_per_user.head()

user_id  movie_id
8        1202        5.0
         2152        3.0
         3106        4.0
         4306        5.0
         4996        4.0
Name: rating, dtype: float64

In [20]:
#temp = df_ratings[df_ratings['user_id']==841872].groupby('user_id')['rating'].max()
#temp.values[0]

5.0

In [21]:
top_user_rating_dict = {}

unique_users = list(df_ratings['user_id'].unique())

for user in unique_users:
    top_rating_for_user = df_ratings[df_ratings['user_id']==user].groupby('user_id')['rating'].max()
    top_movie_for_user = df_ratings[(df_ratings['user_id']==user)&
                                    (df_ratings['rating']==top_rating_for_user.values[0])]['movie_id']
    single_top_movie_for_user = top_movie_for_user.values[0]
    top_user_rating_dict[user] = single_top_movie_for_user

In [25]:
#top_user_rating_dict[250]

14313

In [26]:
#df_ratings[(df_ratings['user_id']==250)&(df_ratings['movie_id']==14313)]

        user_id  rating        date  movie_id
781211      250     5.0  2005-12-16     14313

In [28]:
#unique_users_array = np.array(unique_users)
#unique_users_count = len(unique_users)
#users_per_partition = unique_users_count // 5

#user_bin1 = np.random.choice(unique_users_array, size=users_per_partition, replace=False)

#unique_users2 = [user for user in unique_users if user not in list(user_bin1)]
#unique_users_array2 = np.array(unique_users2)

#user_bin2 = np.random.choice(unique_users_array2, size=users_per_partition, replace=False)

#unique_users3 = [user for user in unique_users2 if user not in list(user_bin2)]
#unique_users_array3 = np.array(unique_users3)

#user_bin3 = np.random.choice(unique_users_array3, size=users_per_partition, replace=False)

#unique_users4 = [user for user in unique_users3 if user not in list(user_bin3)]
#unique_users_array4 = np.array(unique_users4)

#user_bin4 = np.random.choice(unique_users_array4, size=users_per_partition, replace=False)

#unique_users5 = [user for user in unique_users4 if user not in list(user_bin4)]
#user_bin5 = np.array(unique_users5)

In [29]:
#print(len(user_bin1), len(user_bin2), len(user_bin3), len(user_bin4), len(user_bin5))

In [30]:
#os.mkdir(PATH + '/hit_rate_train_test_folds')

In [31]:
#train_hit_rate1 = df_ratings[~df_ratings['user_id'].isin(list(user_bin1))]
#test_hit_rate1 = df_ratings[df_ratings['user_id'].isin(list(user_bin1))]

#train_hit_rate2 = df_ratings[~df_ratings['user_id'].isin(list(user_bin2))]
#test_hit_rate2 = df_ratings[df_ratings['user_id'].isin(list(user_bin2))]

#train_hit_rate3 = df_ratings[~df_ratings['user_id'].isin(list(user_bin3))]
#test_hit_rate3 = df_ratings[df_ratings['user_id'].isin(list(user_bin3))]

#train_hit_rate4 = df_ratings[~df_ratings['user_id'].isin(list(user_bin4))]
#test_hit_rate4 = df_ratings[df_ratings['user_id'].isin(list(user_bin4))]

#train_hit_rate5 = df_ratings[~df_ratings['user_id'].isin(list(user_bin5))]
#test_hit_rate5 = df_ratings[df_ratings['user_id'].isin(list(user_bin5))]

In [32]:
#

In [33]:
#HIT_RATE_PATH = PATH + '/hit_rate_train_test_folds'

#train_hit_rate1.to_csv(HIT_RATE_PATH + '/train_hit_rate1.csv')
#test_hit_rate1.to_csv(HIT_RATE_PATH + '/test_hit_rate1.csv')

#train_hit_rate2.to_csv(HIT_RATE_PATH + '/train_hit_rate2.csv')
#test_hit_rate2.to_csv(HIT_RATE_PATH + '/test_hit_rate2.csv')

#train_hit_rate3.to_csv(HIT_RATE_PATH + '/train_hit_rate3.csv')
#test_hit_rate3.to_csv(HIT_RATE_PATH + '/test_hit_rate3.csv')

#train_hit_rate4.to_csv(HIT_RATE_PATH + '/train_hit_rate4.csv')
#test_hit_rate4.to_csv(HIT_RATE_PATH + '/test_hit_rate4.csv')

#train_hit_rate5.to_csv(HIT_RATE_PATH + '/train_hit_rate5.csv')
#test_hit_rate5.to_csv(HIT_RATE_PATH + '/test_hit_rate5.csv')

In [34]:
with open(PATH + '/top_user_ratings.pkl', 'wb') as location:
    pickle.dump(top_user_rating_dict, location)

In [35]:
df_hit_rate = df_ratings.copy()

In [39]:
#def is_top(user_id):
    #top_movie = top_user_rating_dict[user_id]
    #if df_hit_rate['movie_id'].values == top_movie and df_hit_rate['user_id'].values == user_id:
        #return 1
    #else:
        #return 0

In [41]:
df_hit_rate['top_rated'] = 0
#df_hit_rate.head()

   user_id  rating        date  movie_id  top_rated
0   841872     3.0  2003-03-21      6464          0
1   689085     2.0  2004-05-19      7590          0
2  2529854     4.0  2005-10-22     11837          0
3  2597445     4.0  2005-01-25     10886          0
4  2336656     3.0  2005-07-01      5522          0

In [45]:
#df_hit_rate.head()

   user_id  rating        date  movie_id  top_rated
0   841872     3.0  2003-03-21      6464          0
1   689085     2.0  2004-05-19      7590          0
2  2529854     4.0  2005-10-22     11837          0
3  2597445     4.0  2005-01-25     10886          0
4  2336656     3.0  2005-07-01      5522          0

In [46]:
for i, row in df_hit_rate.iterrows():
    user = row['user_id']
    top_movie = top_user_rating_dict[user]
    if row['user_id'] == user and row['movie_id'] == top_movie:
        df_hit_rate.loc[i, 'top_rated'] = 1

In [47]:
#df_hit_rate['top_rated'].value_counts()

0    4666444
1     264059
Name: top_rated, dtype: int64

In [48]:
#len(top_user_rating_dict)

264059

In [49]:
#df_hit_rate[(df_hit_rate['user_id']==250)&(df_hit_rate['movie_id']==14313)]

        user_id  rating        date  movie_id  top_rated
781211      250     5.0  2005-12-16     14313          1

In [50]:
df_hit_rate_reduced = df_hit_rate[df_hit_rate['top_rated']==0]

In [51]:
os.mkdir(PATH + '/hit_rate_train_test_folds')

In [52]:
HIT_RATE_PATH = PATH + '/hit_rate_train_test_folds'
states = [100, 200, 300, 400, 500]

for i, state in enumerate(states):
    train_df, test_df = train_test_split(df_hit_rate_reduced, test_size=0.5, random_state=state)
    train_df.to_csv(HIT_RATE_PATH + f'/train_df_hit_rate{i}.csv')
    test_df.to_csv(HIT_RATE_PATH + f'/test_df_hit_rate{i}.csv')